Table of Contents
Namespace IdeaRS.OpenModel.Geometry3D
 Classes
ArcSegment3D
Represents an arc segment in three-dimensional space.
CoordSystem
Coordinate system base class
CoordSystemByPoint
Coordinates system defid by the point and the plane
CoordSystemByVector
Coordinate system defined by vectors
CoordSystemByZup
Coordinates system based on local Z axis up In case local X is vertical then Y local axis follows Y global axis.
LineSegment3D
Represents a line segment in three-dimensional space.
Point3D
Represents an x- , y- an z-coordinates in three-dimensional space.
PointOnLine3D
Represents a Point dependent on the line in three-dimensional space.
PolyLine3D
Represents a polyline in three-dimensional space.
Polygon3D
Represents a polygon in three-dimensional space.
Region3D
Represents a region in three-dimensional space included outline (border) and openings.
Segment3D
Represents a segment in three-dimensional space.
Vector3D
Represents a vector in three-dimensional space.
 Enums
Plane
Defines basic planes